Revit 2027 API
AdvancedWood.WoodEarlycolorPerlinEnable Property
 The property labeled "Use perlin noise for earlywood color" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodEarlycolorPerlinEnable { get; }
Public Shared ReadOnly Property WoodEarlycolorPerlinEnable As String
	Get
public:
static property String^ WoodEarlycolorPerlinEnable {
	String^ get ();
}
static member WoodEarlycolorPerlinEnable : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace